sdaiGetADBTypePath(Sdai_ADBId*,System.Int32*)
\details
Returns a pointer to a vector of strings representing the type in the specified ADB.
\param block [in] ADB instance.
\param typeNameNumber [in/out] is a size of typeNameVector.
\returns Returns a pointer to array of strings if successfull, otherwise returns NULL.